[Reference](https://preettheman.medium.com/pandas-tricks-i-wish-i-knew-earlier-b222f8d37f65)

In [1]:
import pandas as pd
d = {'name': ['Sam', 'Mike', 'Lisa'], 'items': [24, 44, 55]}
df = pd.DataFrame(data=d)

In [2]:
df['name'].value_counts()

Sam     1
Mike    1
Lisa    1
Name: name, dtype: int64

In [3]:
df.query('name == "Sam"')

  name  items
0  Sam     24

In [4]:
df.query('items >= 20')

   name  items
0   Sam     24
1  Mike     44
2  Lisa     55

In [5]:
newd = {'name': ['Max', 'Nick', 'Sally'], 'items': [23, 45, 75]}
newdf = pd.DataFrame(data=newd)

In [6]:
fulldf = [df, newdf]

In [7]:
combineddf = pd.concat(fulldf)

In [8]:
df.groupby("name").count()

      items
name
Lisa      1
Mike      1
Sam       1